{
    "version": "1.0",
    "truncation": null,
    "padding": null,
    "added_tokens": [
      {
        "id": 0,
        "content": "[UNK]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 1,
        "content": "[CLS]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 2,
        "content": "[SEP]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 3,
        "content": "[PAD]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 4,
        "content": "[MASK]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 5,
        "content": "H",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 6,
        "content": "M",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 7,
        "content": "S",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 8,
        "content": "E",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      }
    ],
    "normalizer": null,
    "pre_tokenizer": {
      "type": "Whitespace"
    },
    "post_processor": {
      "type": "TemplateProcessing",
      "single": [
        {
          "SpecialToken": {
            "id": "[CLS]",
            "type_id": 0
          }
        },
        {
          "Sequence": {
            "id": "A",
            "type_id": 0
          }
        },
        {
          "SpecialToken": {
            "id": "[SEP]",
            "type_id": 0
          }
        }
      ],
      "pair": [
        {
          "SpecialToken": {
            "id": "[CLS]",
            "type_id": 0
          }
        },
        {
          "Sequence": {
            "id": "A",
            "type_id": 0
          }
        },
        {
          "SpecialToken": {
            "id": "[SEP]",
            "type_id": 0
          }
        },
        {
          "Sequence": {
            "id": "B",
            "type_id": 1
          }
        },
        {
          "SpecialToken": {
            "id": "[SEP]",
            "type_id": 1
          }
        }
      ],
      "special_tokens": {
        "[CLS]": {
          "id": "[CLS]",
          "ids": [
            1
          ],
          "tokens": [
            "[CLS]"
          ]
        },
        "[SEP]": {
          "id": "[SEP]",
          "ids": [
            2
          ],
          "tokens": [
            "[SEP]"
          ]
        }
      }
    },
    "decoder": null,
    "model": {
      "type": "BPE",
      "dropout": null,
      "unk_token": "[UNK]",
      "continuing_subword_prefix": null,
      "end_of_word_suffix": null,
      "fuse_unk": false,
      "byte_fallback": false,
      "vocab": {
        "[UNK]": 0,
        "[CLS]": 1,
        "[SEP]": 2,
        "[PAD]": 3,
        "[MASK]": 4,
        "H": 5,
        "M": 6,
        "S": 7,
        "E": 8,
        "A": 9,
        "C": 10,
        "G": 11,
        "T": 12,
        "a": 13,
        "c": 14,
        "g": 15,
        "t": 16,
        "W": 17,
        "X": 18,
        "Y": 19,
        "Z": 20,
        "R": 21,
        "F": 22,
        "I": 23,
        "J": 24,
        "K": 25,
        "L": 26,
        "N": 27,
        "O": 28,
        "P": 29,
        "Q": 30,
        "U": 31
      },
      "merges": [
      ]
    }
  }